In [1]:
from pandas import DataFrame

In [2]:
data = {
    "city" : ["aaa", "bbb", "ccc", "ddd"],
    "name" : ["김", "이", "박", "최"],
    "job" : ["학생", "경찰", "소방관", "거지"],
    "age" : [11, 22, 33, 44]
}

df = DataFrame(data)
df

   age city  job name
0   11  aaa   학생    김
1   22  bbb   경찰    이
2   33  ccc  소방관    박
3   44  ddd   거지    최

In [3]:
df.name

0    김
1    이
2    박
3    최
Name: name, dtype: object

In [7]:
print(df.loc[2]) # 3 번째 줄 데이터
print(df.name.loc[2]) # column 세 번째 데이터
df = DataFrame(data, index = [14, 1, 3, 2]) # index를 지정하여 생성
df

age      44
city    ddd
job      거지
name      최
Name: 2, dtype: object
최

    age city  job name
14   11  aaa   학생    김
1    22  bbb   경찰    이
3    33  ccc  소방관    박
2    44  ddd   거지    최

In [11]:
import pandas as pd

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [18]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
df.columns = ["aa", "bb", "cc"]
df.index = ["x", "y"]
print(df)

df = pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns = ["aa", "bb", "cc"], index = ["x", "y"])
df = df.append(df.sum(), ignore_index = True)
df.index = ["x", "y", "z"]
print(df)

   aa  bb  cc
x   1   2   3
y   4   5   6
   aa  bb  cc
x   1   2   3
y   4   5   6
z   5   7   9

# Pandas 실습 (1)

In [21]:
import pandas as pd

df = pd.DataFrame([[1000, 2000, 3000, 5000], [600, 150, 800, 900]], 
                  columns = ['1', '2', '3', '4'], 
                  index = ["a", "b"])

df = df.append(df.sum(), ignore_index = True)
df.index = ["a", "b", "sum"]
df

        1     2     3     4
a    1000  2000  3000  5000
b     600   150   800   900
sum  1600  2150  3800  5900

# Pandas 실습 (2)

In [23]:
import pandas as pd

df = pd.DataFrame([["민준", 22, "남", "수학"],
                   ["유리", 20, "여", "영문"],
                   ["재희", 21, "남", "경영"]],
                  columns = ["이름", "나이", "성별", "전공"],
                 index = [1, 2, 3])
df

   이름  나이 성별  전공
1  민준  22  남  수학
2  유리  20  여  영문
3  재희  21  남  경영

# 파일 입출력

In [26]:
import pandas as pd
df = pd.read_excel("kbo_rank.xlsx", sheetname = "Sheet1")
df

/Users/wonjuson/anaconda2/envs/tensorflow/lib/python3.5/site-packages/pandas/util/_decorators.py:118: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  return func(*args, **kwargs)

,순위,팀명,경기,승,패,무,승률,게임차,최근10경기,연속,홈,방문
0,1,두산,104,68,36,0,0.654,0.0,5승0무5패,2패,36-0-13,32-0-23
1,2,SK,103,59,43,1,0.578,8.0,6승0무4패,2승,31-0-18,2028-01-25 00:00:00
2,3,한화,106,59,47,0,0.557,10.0,4승0무6패,2패,32-0-21,27-0-26
3,4,LG,107,53,53,1,0.500,16.0,2승0무8패,5패,1931-01-22 00:00:00,22-0-31
4,5,넥센,109,53,56,0,0.486,17.5,5승0무5패,3승,24-0-32,29-0-24
5,6,삼성,107,50,54,3,0.481,18.0,6승1무3패,1승,2024-02-25 00:00:00,2026-01-29 00:00:00
6,7,KIA,102,48,54,0,0.471,19.0,5승0무5패,2승,31-0-23,17-0-31
7,8,롯데,103,45,56,2,0.446,21.5,6승0무4패,1패,24-0-29,2021-02-27 00:00:00
8,9,KT,104,43,59,2,0.422,24.0,4승0무6패,4패,2022-02-28 00:00:00,21-0-31
9,10,NC,107,43,63,1,0.406,26.0,6승1무3패,2승,23-0-32,2020-01-31 00:00:00

In [31]:
import pandas as pd

df1 = pd.read_csv("LEC_03_data.csv")
print(df1, "\n")
print(df1[: 3])

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer

# 열을 이용한 데이터 추출
### 첫행부터 인덱스 2행까지

In [33]:
df1[:3]

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer

### 인덱스 3행부터 4행까지

In [34]:
df1[3 : 5]

   Name Country  Age        Job
3  Sato   Japan   40       Chef
4   Lee   Korea   36  Professor

### 인덱스 4행부터 끝까지

In [35]:
df1[4 :]

    Name Country  Age        Job
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO

### 0행 데이터 추출

In [38]:
df1.loc[0]

Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

### 0, 3행 데이터 추출

In [42]:
df1.loc[[0, 3]]

   Name Country  Age      Job
0  John     USA   31  Student
3  Sato   Japan   40     Chef

### 1, 2, 5행 데이터 추출

In [43]:
df1.loc[[1, 2, 5]]

    Name Country  Age        Job
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
5  Smith     USA   55        CEO

### 'Country' 열 데이터 추출

In [47]:
df1["Country"]

0       USA
1    France
2     Korea
3     Japan
4     Korea
5       USA
Name: Country, dtype: object

### "Name", "Country" 열 데이터 추출

In [48]:
df1[["Name", "Country"]]

    Name Country
0   John     USA
1  Sabre  France
2    Kim   Korea
3   Sato   Japan
4    Lee   Korea
5  Smith     USA

### "Name", "Country", "Job" 열 데이터 추출

In [49]:
df1[["Name", "Country", "Job"]]

    Name Country        Job
0   John     USA    Student
1  Sabre  France     Lawyer
2    Kim   Korea  Developer
3   Sato   Japan       Chef
4    Lee   Korea  Professor
5  Smith     USA        CEO